; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_6)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 - link
    angle0 angle30 angle60 angle90 angle120 angle150 angle180 angle210 angle240 angle270 angle300 angle330 - angle)
(:init
    (AngleOrd angle0 angle30)
    (AngleOrd angle30 angle60)
    (AngleOrd angle60 angle90)
    (AngleOrd angle90 angle120)
    (AngleOrd angle120 angle150)
    (AngleOrd angle150 angle180)
    (AngleOrd angle180 angle210)
    (AngleOrd angle210 angle240)
    (AngleOrd angle240 angle270)
    (AngleOrd angle270 angle300)
    (AngleOrd angle300 angle330)
    (AngleOrd angle330 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)
    (Affected link5 link1)
    (Affected link5 link2)
    (Affected link5 link3)
    (Affected link5 link4)

    (HasAngle angle300 link1)
    (HasAngle angle90 link2)
    (HasAngle angle150 link3)
    (HasAngle angle180 link4)
    (HasAngle angle270 link5)
)
(:goal
(and
    (HasAngle angle270 link1)
    (HasAngle angle240 link2)
    (HasAngle angle300 link3)
    (HasAngle angle120 link4)
    (HasAngle angle90 link5)
    )
)
)

; plan
1. (decrease_angle link1 angle300 angle270)
   deleted: (hasangle angle300 link1) (hasangle angle90 link2) (hasangle angle150 link3) (hasangle angle180 link4) (hasangle angle270 link5)
   added: (hasangle angle270 link1) (hasangle angle60 link2) (hasangle angle120 link3) (hasangle angle150 link4) (hasangle angle240 link5)
   goals met: 1 of 5
2. (decrease_angle link1 angle270 angle240)
   deleted: (hasangle angle270 link1) (hasangle angle60 link2) (hasangle angle120 link3) (hasangle angle150 link4) (hasangle angle240 link5)
   added: (hasangle angle240 link1) (hasangle angle30 link2) (hasangle angle90 link3) (hasangle angle120 link4) (hasangle angle210 link5)
   goals met: 1 of 5
3. (decrease_angle link2 angle30 angle0)
   deleted: (hasangle angle30 link2) (hasangle angle90 link3) (hasangle angle120 link4) (hasangle angle210 link5)
   added: (hasangle angle0 link2) (hasangle angle60 link3) (hasangle angle90 link4) (hasangle angle180 link5)
   goals met: 0 of 5
4. (decrease_angle link2 angle0 angle330)
   deleted: (hasangle angle0 link2) (hasangle angle60 link3) (hasangle angle90 link4) (hasangle angle180 link5)
   added: (hasangle angle330 link2) (hasangle angle30 link3) (hasangle angle60 link4) (hasangle angle150 link5)
   goals met: 0 of 5
5. (decrease_angle link2 angle330 angle300)
   deleted: (hasangle angle330 link2) (hasangle angle30 link3) (hasangle angle60 link4) (hasangle angle150 link5)
   added: (hasangle angle300 link2) (hasangle angle0 link3) (hasangle angle30 link4) (hasangle angle120 link5)
   goals met: 0 of 5
6. (decrease_angle link2 angle300 angle270)
   deleted: (hasangle angle300 link2) (hasangle angle0 link3) (hasangle angle30 link4) (hasangle angle120 link5)
   added: (hasangle angle270 link2) (hasangle angle330 link3) (hasangle angle0 link4) (hasangle angle90 link5)
   goals met: 1 of 5
7. (increase_angle link1 angle240 angle270)
   deleted: (hasangle angle240 link1) (hasangle angle270 link2) (hasangle angle330 link3) (hasangle angle0 link4) (hasangle angle90 link5)
   added: (hasangle angle270 link1) (hasangle angle300 link2) (hasangle angle0 link3) (hasangle angle30 link4) (hasangle angle120 link5)
   goals met: 1 of 5
8. (decrease_angle link2 angle300 angle270)
   deleted: (hasangle angle300 link2) (hasangle angle0 link3) (hasangle angle30 link4) (hasangle angle120 link5)
   added: (hasangle angle270 link2) (hasangle angle330 link3) (hasangle angle0 link4) (hasangle angle90 link5)
   goals met: 2 of 5
9. (decrease_angle link2 angle270 angle240)
   deleted: (hasangle angle270 link2) (hasangle angle330 link3) (hasangle angle0 link4) (hasangle angle90 link5)
   added: (hasangle angle240 link2) (hasangle angle300 link3) (hasangle angle330 link4) (hasangle angle60 link5)
   goals met: 3 of 5
10. (increase_angle link4 angle330 angle0)
   deleted: (hasangle angle330 link4) (hasangle angle60 link5)
   added: (hasangle angle0 link4) (hasangle angle90 link5)
   goals met: 4 of 5
11. (increase_angle link4 angle0 angle30)
   deleted: (hasangle angle0 link4) (hasangle angle90 link5)
   added: (hasangle angle30 link4) (hasangle angle120 link5)
   goals met: 3 of 5
12. (decrease_angle link5 angle120 angle90)
   deleted: (hasangle angle120 link5)
   added: (hasangle angle90 link5)
   goals met: 4 of 5
13. (increase_angle link4 angle30 angle60)
   deleted: (hasangle angle30 link4) (hasangle angle90 link5)
   added: (hasangle angle60 link4) (hasangle angle120 link5)
   goals met: 3 of 5
14. (decrease_angle link5 angle120 angle90)
   deleted: (hasangle angle120 link5)
   added: (hasangle angle90 link5)
   goals met: 4 of 5
15. (increase_angle link4 angle60 angle90)
   deleted: (hasangle angle60 link4) (hasangle angle90 link5)
   added: (hasangle angle90 link4) (hasangle angle120 link5)
   goals met: 3 of 5
16. (decrease_angle link5 angle120 angle90)
   deleted: (hasangle angle120 link5)
   added: (hasangle angle90 link5)
   goals met: 4 of 5
17. (increase_angle link4 angle90 angle120)
   deleted: (hasangle angle90 link4) (hasangle angle90 link5)
   added: (hasangle angle120 link4) (hasangle angle120 link5)
   goals met: 4 of 5
18. (decrease_angle link5 angle120 angle90)
   deleted: (hasangle angle120 link5)
   added: (hasangle angle90 link5)
   goals met: 5 of 5
